date_spot-rails/app/controllers/application_controller.rb

  def current_user
    @current_user ||= super || User.find(@current_user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]