date_spot-rails/app/controllers/api/v1/spots_controller.rb

SELECT "spots".* FROM "spots"
---
  def index
    @spots = Spot.all

SELECT "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_spot
    @spot = Spot.find(params[:id])