date_spot/app/controllers/api/v1/spots_controller.rb

SELECT "spots".* FROM "spots"
---
  def index
    @spots = Spot.all